benchmarks/logs/2026-04-29_09-47-07/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38ms    3.87ms  40.75ms   96.77%
    Req/Sec     2.79k   428.30     3.33k    63.00%
  Latency Distribution
     50%    1.55ms
     75%    1.62ms
     90%    3.07ms
     99%   27.04ms
  166596 requests in 30.01s, 1.76GB read
Requests/sec:   5550.53
Transfer/sec:     59.97MB