benchmarks/logs/2026-04-29_09-47-07/burst_post_bookmarks.txt
Running 10s test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.17ms   18.22ms 128.74ms   69.35%
    Req/Sec   160.53    159.51     1.38k    93.00%
  Latency Distribution
     50%   24.49ms
     75%   35.24ms
     90%   47.56ms
     99%   89.42ms
  1608 requests in 10.07s, 702.57MB read
Requests/sec:    159.73
Transfer/sec:     69.79MB